; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	spectrograph0 - mode
	infrared2 - mode
	spectrograph1 - mode
	image3 - mode
	Star2 - direction
	Star3 - direction
	Star4 - direction
	Star1 - direction
	GroundStation5 - direction
	GroundStation0 - direction
	Star6 - direction
	Planet7 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Star10 - direction
	Star11 - direction
	Phenomenon12 - direction
	Phenomenon13 - direction
	Star14 - direction
)
(:init
	(supports instrument0 infrared2)
	(supports instrument0 spectrograph1)
	(supports instrument0 spectrograph0)
	(calibration_target instrument0 Star4)
	(calibration_target instrument0 GroundStation5)
	(supports instrument1 spectrograph1)
	(calibration_target instrument1 Star1)
	(calibration_target instrument1 GroundStation5)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon9)
	(supports instrument2 image3)
	(supports instrument2 spectrograph1)
	(calibration_target instrument2 GroundStation5)
	(supports instrument3 spectrograph0)
	(supports instrument3 infrared2)
	(supports instrument3 spectrograph1)
	(calibration_target instrument3 GroundStation0)
	(calibration_target instrument3 GroundStation5)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star2)
)
(:goal (and
	(pointing satellite0 Phenomenon12)
	(have_image Star6 spectrograph1)
	(have_image Planet7 infrared2)
	(have_image Planet8 spectrograph1)
	(have_image Phenomenon9 image3)
	(have_image Star10 spectrograph1)
	(have_image Star11 infrared2)
	(have_image Phenomenon12 spectrograph1)
	(have_image Phenomenon13 image3)
	(have_image Star14 spectrograph1)
))

)

; plan
1. (turn_to satellite1 groundstation5 star2)
   deleted: (pointing satellite1 star2)
   added: (pointing satellite1 groundstation5)
   goals met: 0 of 10
2. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 10
3. (calibrate satellite1 instrument2 groundstation5)
   added: (calibrated instrument2)
   goals met: 0 of 10
4. (turn_to satellite1 planet8 groundstation5)
   deleted: (pointing satellite1 groundstation5)
   added: (pointing satellite1 planet8)
   goals met: 0 of 10
5. (take_image satellite1 planet8 instrument2 spectrograph1)
   added: (have_image planet8 spectrograph1)
   goals met: 1 of 10
6. (turn_to satellite1 phenomenon9 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 phenomenon9)
   goals met: 1 of 10
7. (take_image satellite1 phenomenon9 instrument2 image3)
   added: (have_image phenomenon9 image3)
   goals met: 2 of 10
8. (turn_to satellite1 phenomenon13 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 phenomenon13)
   goals met: 2 of 10
9. (turn_to satellite0 groundstation5 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 groundstation5)
   goals met: 2 of 10
10. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 2 of 10
11. (calibrate satellite0 instrument0 groundstation5)
   added: (calibrated instrument0)
   goals met: 2 of 10
12. (take_image satellite1 phenomenon13 instrument2 image3)
   added: (have_image phenomenon13 image3)
   goals met: 3 of 10
13. (turn_to satellite0 planet7 groundstation5)
   deleted: (pointing satellite0 groundstation5)
   added: (pointing satellite0 planet7)
   goals met: 3 of 10
14. (take_image satellite0 planet7 instrument0 infrared2)
   added: (have_image planet7 infrared2)
   goals met: 4 of 10
15. (turn_to satellite0 star10 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 star10)
   goals met: 4 of 10
16. (take_image satellite0 star10 instrument0 spectrograph1)
   added: (have_image star10 spectrograph1)
   goals met: 5 of 10
17. (turn_to satellite0 star11 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star11)
   goals met: 5 of 10
18. (take_image satellite0 star11 instrument0 infrared2)
   added: (have_image star11 infrared2)
   goals met: 6 of 10
19. (turn_to satellite0 phenomenon12 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 phenomenon12)
   goals met: 7 of 10
20. (take_image satellite0 phenomenon12 instrument0 spectrograph1)
   added: (have_image phenomenon12 spectrograph1)
   goals met: 8 of 10
21. (turn_to satellite1 star14 phenomenon13)
   deleted: (pointing satellite1 phenomenon13)
   added: (pointing satellite1 star14)
   goals met: 8 of 10
22. (take_image satellite1 star14 instrument2 spectrograph1)
   added: (have_image star14 spectrograph1)
   goals met: 9 of 10
23. (turn_to satellite1 star6 star14)
   deleted: (pointing satellite1 star14)
   added: (pointing satellite1 star6)
   goals met: 9 of 10
24. (take_image satellite1 star6 instrument2 spectrograph1)
   added: (have_image star6 spectrograph1)
   goals met: 10 of 10
